In [2]:
!pip install psycopg2-binary sqlalchemy pandas

Requirement already satisfied: psycopg2-binary in /opt/anaconda3/lib/python3.12/site-packages (2.9.10)
Requirement already satisfied: sqlalchemy in /opt/anaconda3/lib/python3.12/site-packages (2.0.34)
Requirement already satisfied: pandas in /opt/anaconda3/lib/python3.12/site-packages (2.2.2)
Requirement already satisfied: typing-extensions>=4.6.0 in /opt/anaconda3/lib/python3.12/site-packages (from sqlalchemy) (4.11.0)
Requirement already satisfied: numpy>=1.26.0 in /opt/anaconda3/lib/python3.12/site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in /opt/anaconda3/lib/python3.12/site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in /opt/anaconda3/lib/python3.12/site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in /opt/anaconda3/lib/python3.12/site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in /opt/anaconda3/lib/python3.12/site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [4]:
from sqlalchemy import create_engine, text
import pandas as pd

# connect to PostgreSQL 
engine = create_engine("postgresql+psycopg2://postgres:123@localhost:5432/5310Group")
conn = engine.connect()

## MTA

In [6]:
# Create Tables
create_sql = """
DROP TABLE IF EXISTS unified_locations,station_directions, daytime_service, station_lines, station_location, stations, lines, unified_locations CASCADE;
 
CREATE TABLE unified_locations (
    location_id SERIAL PRIMARY KEY,
    latitude NUMERIC(9,6),
    longitude NUMERIC(9,6),
    zipcode CHAR(5),
    UNIQUE(latitude, longitude)
);

CREATE TABLE lines (
    line_id SERIAL PRIMARY KEY,
    line_name TEXT UNIQUE
);

CREATE TABLE stations (
    station_id INTEGER PRIMARY KEY,
    stop_name TEXT NOT NULL,
    borough_code TEXT,
    cbd BOOLEAN
);

CREATE TABLE station_location (
    station_location_id SERIAL PRIMARY KEY,
    station_id INTEGER REFERENCES stations(station_id) ON DELETE CASCADE,
    location_id INT REFERENCES unified_locations(location_id)
);

CREATE TABLE station_lines (
    station_id INTEGER,
    line_id INTEGER,
    PRIMARY KEY (station_id),
    FOREIGN KEY (station_id) REFERENCES stations(station_id),
    FOREIGN KEY (line_id) REFERENCES lines(line_id)
);

CREATE TABLE daytime_service (
    station_id INTEGER,
    train_code TEXT,
    PRIMARY KEY (station_id, train_code),
    FOREIGN KEY (station_id) REFERENCES stations(station_id)
);

CREATE TABLE station_directions (
    station_id INTEGER PRIMARY KEY,
    north_direction TEXT,
    south_direction TEXT,
    FOREIGN KEY (station_id) REFERENCES stations(station_id)
);
"""

In [8]:
with engine.begin() as conn:
    conn.execute(text(create_sql))
    print(" All tables created successfully in 5310Group.")

 All tables created successfully in 5310Group.

In [10]:
import pandas as pd
from sqlalchemy import create_engine, text

file_path = "/Users/celine/Desktop/MTA_data.xlsx"
df = pd.read_excel(file_path, sheet_name="sheet1")

In [12]:
!pip install sqlalchemy psycopg2-binary

Requirement already satisfied: sqlalchemy in /opt/anaconda3/lib/python3.12/site-packages (2.0.34)
Requirement already satisfied: psycopg2-binary in /opt/anaconda3/lib/python3.12/site-packages (2.9.10)
Requirement already satisfied: typing-extensions>=4.6.0 in /opt/anaconda3/lib/python3.12/site-packages (from sqlalchemy) (4.11.0)

In [14]:
# Insert line_name into lines table（without specifying line_id）
lines_df = df[['line_name']].drop_duplicates()
lines_df.to_sql("lines", engine, if_exists="append", index=False, method='multi')

34

In [16]:
# Read the complete lines table from the database with auto-generated line_id included
lines_db = pd.read_sql("SELECT * FROM lines", engine)

# merge line_id to the original df
df_with_line_id = df.merge(lines_db, on='line_name', how='left')

In [18]:
df_with_line_id.head(10)

,station_id,line_name,stop_name,borough_code,cbd,daytime_routes,latitude,longitude,north_direction,south_direction,zipcode,line_id
0,1,Astoria,Astoria-Ditmars Blvd,Q,False,N W,40.775036,-73.912034,Last Stop,Manhattan,11101,1
1,2,Astoria,Astoria Blvd,Q,False,N W,40.770258,-73.917843,Astoria,Manhattan,11101,1
2,3,Astoria,30 Av,Q,False,N W,40.766779,-73.921479,Astoria,Manhattan,11102,1
3,4,Astoria,Broadway,Q,False,N W,40.761820,-73.925508,Astoria,Manhattan,11106,1
4,5,Astoria,36 Av,Q,False,N W,40.756804,-73.929575,Astoria,Manhattan,11106,1
5,6,Astoria,39 Av-Dutch Kills,Q,False,N W,40.752882,-73.932755,Astoria,Manhattan,11101,1
6,7,Astoria,Lexington Av/59 St,M,True,N R W,40.762660,-73.967258,Queens,Downtown,10035,1
7,8,Astoria,5 Av/59 St,M,True,N R W,40.764811,-73.973347,Queens,Downtown,10019,1
8,9,Broadway - Brighton,57 St-7 Av,M,True,N Q R W,40.764664,-73.980658,Uptown,Downtown,10019,2
9,10,Broadway - Brighton,49 St,M,True,N R W,40.759901,-73.984139,Uptown,Downtown,10019,2

In [20]:
# insert data into stations
stations_df = df_with_line_id[['station_id', 'stop_name','borough_code','cbd']].drop_duplicates()
stations_df.to_sql("stations", engine, if_exists="append", index=False, method='multi')

496

In [22]:
# insert data into station_lines
station_lines_df = df_with_line_id[['station_id', 'line_id']].drop_duplicates()

In [24]:
station_lines_df.head(5)

   station_id  line_id
0           1        1
1           2        1
2           3        1
3           4        1
4           5        1

In [26]:
station_lines_df.to_sql("station_lines", engine, if_exists="append", index=False, method='multi')

496

In [28]:
# insert data into Unified_Locations table
locations_df = df[['latitude', 'longitude', 'zipcode']].drop_duplicates().reset_index(drop=True)
locations_df["latitude"] = locations_df["latitude"].round(6)
locations_df["longitude"] = locations_df["longitude"].round(6)

locations_df['location_id'] = locations_df.index + 1
locations_df.to_sql("unified_locations", engine, if_exists="append", index=False, method='multi')

493

In [30]:
# insert data into Station_Location table
df_with_location_id = df.merge(locations_df, on=['latitude', 'longitude', 'zipcode'], how='left')
station_location_df = df_with_location_id[['station_id', 'location_id']]
station_location_df.to_sql("station_location", engine, if_exists="append", index=False, method='multi')

496

In [32]:
df_with_line_id.head(5)

,station_id,line_name,stop_name,borough_code,cbd,daytime_routes,latitude,longitude,north_direction,south_direction,zipcode,line_id
0,1,Astoria,Astoria-Ditmars Blvd,Q,False,N W,40.775036,-73.912034,Last Stop,Manhattan,11101,1
1,2,Astoria,Astoria Blvd,Q,False,N W,40.770258,-73.917843,Astoria,Manhattan,11101,1
2,3,Astoria,30 Av,Q,False,N W,40.766779,-73.921479,Astoria,Manhattan,11102,1
3,4,Astoria,Broadway,Q,False,N W,40.761820,-73.925508,Astoria,Manhattan,11106,1
4,5,Astoria,36 Av,Q,False,N W,40.756804,-73.929575,Astoria,Manhattan,11106,1

In [34]:
df_with_line_id['daytime_routes'] = df_with_line_id['daytime_routes'].astype(str)
daytime_service_rows = []
for _, row in df_with_line_id.iterrows():
    for code in row['daytime_routes'].split():
        daytime_service_rows.append({'station_id': row['station_id'], 'train_code': code})
daytime_service_df = pd.DataFrame(daytime_service_rows)

In [36]:
daytime_service_df.head(5)

   station_id train_code
0           1          N
1           1          W
2           2          N
3           2          W
4           3          N

In [38]:
# insert data into Daytime_Service table
daytime_service_df = daytime_service_df.dropna()
daytime_service_df.to_sql("daytime_service", engine, if_exists="append", index=False, method='multi')

767

In [40]:
# insert data into Station_Directions table
directions_df = df[['station_id', 'north_direction', 'south_direction']].drop_duplicates()
directions_df.to_sql("station_directions", engine, if_exists="append", index=False, method='multi')

print(" All data successfully inserted into PostgreSQL！")

 All data successfully inserted into PostgreSQL！

#Test

In [111]:
tables = ["lines", "stations", "unified_locations", "station_location", "station_lines", "daytime_service", "station_directions"]
for table in tables:
    count = pd.read_sql(f"SELECT COUNT(*) FROM {table};", con=engine)
    print(f"Table {table} has {count.iloc[0, 0]} rows.")

stations_check = pd.read_sql("SELECT * FROM stations LIMIT 5;", con=engine)
print(stations_check)

Table lines has 34 rows.
Table stations has 496 rows.
Table unified_locations has 493 rows.
Table station_location has 496 rows.
Table station_lines has 496 rows.
Table daytime_service has 767 rows.
Table station_directions has 496 rows.
   station_id             stop_name borough_code    cbd
0           1  Astoria-Ditmars Blvd            Q  False
1           2          Astoria Blvd            Q  False
2           3                 30 Av            Q  False
3           4              Broadway            Q  False
4           5                 36 Av            Q  False